redisTestResult/redisMigrationTestResult/redisMigrationTestResult-thirdTest-perf/redi-LPLD-3.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets       406605.63    406605.63         0.00       539.82518       536.57500      1044.47900      1048.57500     26817.33 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     406605.63    406605.63         0.00       539.82518       536.57500      1044.47900      1048.57500     26817.33 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.000      100.000
---
GET      15.807        0.000
GET      76.799        5.000
GET     112.127       10.000
GET     176.127       15.000
GET     241.663       20.000
GET     284.671       25.000
GET     337.919       30.000
GET     389.119       35.000
GET     436.223       40.000
GET     495.615       45.000
GET     536.575       50.000
GET     573.439       52.500
GET     602.111       55.000
GET     614.399       57.500
GET     630.783       60.000
GET     675.839       62.500
GET     700.415       65.000
GET     720.895       67.500
GET     733.183       70.000
GET     774.143       72.500
GET     806.911       75.000
GET     819.199       76.250
GET     823.295       77.500
GET     831.487       78.750
GET     839.679       80.000
GET     851.967       81.250
GET     876.543       82.500
GET     897.023       83.750
GET     909.311       85.000
GET     921.599       86.250
GET     929.791       87.500
GET     933.887       88.125
GET     937.983       88.750
GET     942.079       89.375
GET     946.175       90.000
GET     950.271       90.625
GET     954.367       91.250
GET     962.559       91.875
GET     974.847       92.500
GET     983.039       93.125
GET     995.327       93.750
GET    1003.519       94.062
GET    1007.615       94.375
GET    1011.711       94.688
GET    1011.711       95.000
GET    1015.807       95.312
GET    1019.903       95.625
GET    1023.999       95.938
GET    1028.095       96.250
GET    1028.095       96.562
GET    1032.191       96.875
GET    1032.191       97.031
GET    1036.287       97.188
GET    1036.287       97.344
GET    1036.287       97.500
GET    1036.287       97.656
GET    1036.287       97.812
GET    1040.383       97.969
GET    1040.383       98.125
GET    1040.383       98.281
GET    1040.383       98.438
GET    1040.383       98.516
GET    1040.383       98.594
GET    1040.383       98.672
GET    1044.479       98.750
GET    1044.479       98.828
GET    1044.479       98.906
GET    1044.479       98.984
GET    1044.479       99.062
GET    1044.479       99.141
GET    1044.479       99.219
GET    1044.479       99.258
GET    1044.479       99.297
GET    1048.575       99.336
GET    1048.575      100.000
---
WAIT      0.000      100.000