redisTestResult/redisMigrationTestResult/redisMigrationTestResult-thirdTest-perf/redi-RPILD-3.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets       234907.15    234907.15         0.00       546.80489       548.86300      1044.47900      1048.57500     15493.10 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     234907.15    234907.15         0.00       546.80489       548.86300      1044.47900      1048.57500     15493.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.000      100.000
---
GET      26.111        0.000
GET      77.311        5.000
GET     114.175       10.000
GET     183.295       15.000
GET     226.303       20.000
GET     292.863       25.000
GET     346.111       30.000
GET     389.119       35.000
GET     442.367       40.000
GET     503.807       45.000
GET     548.863       50.000
GET     561.151       52.500
GET     573.439       55.000
GET     638.975       57.500
GET     663.551       60.000
GET     688.127       62.500
GET     708.607       65.000
GET     720.895       67.500
GET     729.087       70.000
GET     794.623       72.500
GET     819.199       75.000
GET     831.487       76.250
GET     847.871       77.500
GET     856.063       78.750
GET     864.255       80.000
GET     876.543       81.250
GET     880.639       82.500
GET     880.639       83.750
GET     888.831       85.000
GET     933.887       86.250
GET     950.271       87.500
GET     966.655       88.125
GET     970.751       88.750
GET     974.847       89.375
GET     978.943       90.000
GET     987.135       90.625
GET     991.231       91.250
GET     995.327       91.875
GET    1007.615       92.500
GET    1011.711       93.125
GET    1015.807       93.750
GET    1015.807       94.062
GET    1019.903       94.375
GET    1023.999       94.688
GET    1023.999       95.000
GET    1028.095       95.312
GET    1032.191       95.625
GET    1032.191       95.938
GET    1036.287       96.250
GET    1036.287       96.562
GET    1036.287       96.875
GET    1040.383       97.031
GET    1040.383       97.188
GET    1040.383       97.344
GET    1040.383       97.500
GET    1040.383       97.656
GET    1040.383       97.812
GET    1040.383       97.969
GET    1040.383       98.125
GET    1044.479       98.281
GET    1044.479       98.438
GET    1044.479       98.516
GET    1044.479       98.594
GET    1044.479       98.672
GET    1044.479       98.750
GET    1044.479       98.828
GET    1044.479       98.906
GET    1044.479       98.984
GET    1044.479       99.062
GET    1044.479       99.141
GET    1044.479       99.219
GET    1044.479       99.258
GET    1044.479       99.297
GET    1044.479       99.336
GET    1048.575       99.375
GET    1048.575      100.000
---
WAIT      0.000      100.000